Revit 2024 API
DetailElementOrderUtils.AreDetailElements Method
 Indicates if the elements are all detail elements that participate in detail draw ordering in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool AreDetailElements(
	Document document,
	View view,
	ICollection<ElementId> detailElementIds
)
Visual Basic
Public Shared Function AreDetailElements ( _
	document As Document, _
	view As View, _
	detailElementIds As ICollection(Of ElementId) _
) As Boolean
Visual C++
public:
static bool AreDetailElements(
	Document^ document,
	View^ view,
	ICollection<ElementId^>^ detailElementIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
view
Type: Autodesk.Revit.DB.View
 The view in which the details appear.
detailElementIds
Type: System.Collections.Generic.ICollection<ElementId>
 The details to check.
Return Value
 True if the detail elements are orderable in the view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace